TRUNCATE TABLE meals CASCADE ;
TRUNCATE TABLE user_role CASCADE ;
TRUNCATE TABLE users CASCADE ;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin'),
       ('Guest', 'guest@gmail.com', 'guest');

INSERT INTO user_role (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO meals (user_id, date_time, description, calories)
VALUES  (100000, '2023-01-01 06:23:00', 'завтрак', '859'),
        (100000, '2023-01-01 11:23:00', 'обед', '458'),
        (100000, '2023-01-01 20:23:00', 'ужин', '745'),
        (100000, '2023-01-02 08:23:00', 'завтрак', '785'),
        (100000, '2023-01-02 14:23:00', 'обед', '565'),
        (100000, '2023-01-02 21:23:00', 'ужин', '985'),
        (100000, '2023-01-03 08:23:00', 'завтрак', '653'),
        (100000, '2023-01-03 12:23:00', 'обед', '845'),
        (100000, '2023-01-03 23:23:00', 'ужин', '456'),
        (100001, '2023-01-01 09:23:00', 'завтрак', '741'),
        (100001, '2023-01-01 12:23:00', 'обед', '852'),
        (100001, '2023-01-01 16:23:00', 'ужин', '963'),
        (100001, '2023-01-02 11:23:00', 'завтрак', '789'),
        (100001, '2023-01-02 14:23:00', 'обед', '654'),
        (100001, '2023-01-02 20:23:00', 'ужин', '923'),
        (100001, '2023-01-03 07:23:00', 'завтрак', '200'),
        (100001, '2023-01-03 15:23:00', 'обед', '740'),
        (100001, '2023-01-03 22:23:00', 'ужин', '1000');

